Revit 2027 API
ComputationDataFor3DPathSet.GetTerminationPlaneNormal Method
 Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetTerminationPlaneNormal(
	int end
)
Public Function GetTerminationPlaneNormal (
	end As Integer
) As XYZ
public:
XYZ^ GetTerminationPlaneNormal(
	int end
)
member GetTerminationPlaneNormal :
        end : int -> XYZ
Parameters
end Int32
 The end of bar. Should be 0 for start or 1 for end.
Return Value
XYZ
 Returns the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Invalid end.
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace